### 구글드라이브 연동

In [1]:
# # 구글드라이브 연동
# from google.colab import drive
# drive.mount('/gdrive', force_remount=True)

# # 구글 드라이브 파일 확인
# !ls '/gdrive/My Drive/temp/'

# # 반복되는 드라이브 경로 변수화
# drive_path = '/gdrive/My Drive/temp/'

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /gdrive
매수종목1.txt  example.docx	      ratings_small.txt  score.csv
매수종목2.txt  height_weight.txt      sample1.pdf	 test.db.db
매수종목.csv   HelloWorld.xlsx	      sample2.pdf	 test.txt
database       little-char.png	      sample_merge.pdf	 train.csv
demo.docx      population_number.csv  sample.xlsx	 user_id_mean.csv

# Pandas
데이터 핸들링

## Pandas 요약

### 데이터프레임(Dataframe)과 시리즈(Series)

In [3]:
# 시리즈와 데이터프레임 두가지가 기본이다
# 자동으로 인덱스가 만들어진다

import numpy as np
import pandas as pd

In [ ]:
dic = {'city': ['서울', '부산', '대전', '대구', '광주'],
        'year': [2017, 2017, 2018, 2018, 2018],
        'temp': [18, 20, 19, 21, 20]}
data = pd.DataFrame(dic) ; data

  city  year  temp
0   서울  2017    18
1   부산  2017    20
2   대전  2018    19
3   대구  2018    21
4   광주  2018    20

In [ ]:
data[['year', 'city', 'temp']]

   year city  temp
0  2017   서울    18
1  2017   부산    20
2  2018   대전    19
3  2018   대구    21
4  2018   광주    20

In [ ]:
data.index = ['a','b','c','d','e'] ; data

  city  year  temp
a   서울  2017    18
b   부산  2017    20
c   대전  2018    19
d   대구  2018    21
e   광주  2018    20

In [ ]:
data.columns = ['도시','연도','날씨'] ; data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [ ]:
data.set_index(['도시'])

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [ ]:
data['연도']

a    2017
b    2017
c    2018
d    2018
e    2018
Name: 연도, dtype: int64

In [ ]:
data.연도

a    2017
b    2017
c    2018
d    2018
e    2018
Name: 연도, dtype: int64

In [ ]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [ ]:
data.loc['a']

도시      서울
연도    2017
날씨      18
Name: a, dtype: object

In [ ]:
data

   도시    연도  날씨
a  서울  2017  18
b  부산  2017  20
c  대전  2018  19
d  대구  2018  21
e  광주  2018  20

In [ ]:
data.set_index(['도시'], inplace=True) ; data

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

In [ ]:
data.loc['서울']

연도    2017
날씨      18
Name: 서울, dtype: int64

In [ ]:
data.loc[['서울','부산']]

      연도  날씨
도시
서울  2017  18
부산  2017  20

In [ ]:
data.iloc[1:3]

      연도  날씨
도시
부산  2017  20
대전  2018  19

In [ ]:
cars = [50,40,20,30,10]
data['car'] = cars ; data

      연도  날씨  car
도시
서울  2017  18   50
부산  2017  20   40
대전  2018  19   20
대구  2018  21   30
광주  2018  20   10

In [ ]:
data['high'] = data.car >= 30 ; data

      연도  날씨  car   high
도시
서울  2017  18   50   True
부산  2017  20   40   True
대전  2018  19   20  False
대구  2018  21   30   True
광주  2018  20   10  False

In [ ]:
data.drop('car', 1)

      연도  날씨   high
도시
서울  2017  18   True
부산  2017  20   True
대전  2018  19  False
대구  2018  21   True
광주  2018  20  False

In [ ]:
data.drop(['car', 'high'], 1)

      연도  날씨
도시
서울  2017  18
부산  2017  20
대전  2018  19
대구  2018  21
광주  2018  20

### 람다 함수

In [ ]:
f = lambda x: x.max() - x.min()

df = pd.DataFrame(np.arange(12).reshape(4, 3), 
                  columns=['A', 'B', 'C'], index=['a', 'b', 'c', 'd'])
df

   A   B   C
a  0   1   2
b  3   4   5
c  6   7   8
d  9  10  11

In [ ]:
df.apply(f)

A    9
B    9
C    9
dtype: int64

In [ ]:
df.apply(f, 1)

a    2
b    2
c    2
d    2
dtype: int64

### Series

In [ ]:
# 파이썬 기본 타입인  딕셔너리로부터 시리즈를 만들 수 있다
dic = {'서울':800, '부산':150, '대구': 100}
dic

{'서울': 800, '부산': 150, '대구': 100}

In [ ]:
s = pd.Series(dic) ; s

서울    800
부산    150
대구    100
dtype: int64

## Pandas 기초
Pandas 모듈
- Series Class : 1차원
 - 인덱스(index) + 값(value)
- DataFrame Class : 2차원
 - 표와 같은 형태

In [ ]:
import pandas as pd

### Series

In [ ]:
# Series 생성
s = pd.Series([4, 7, -5, 3])
s

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
# 인덱스 지정하여 생성
s = pd.Series([4, 7, -5, 3], index=['d','b','a','c'])
s

d    4
b    7
a   -5
c    3
dtype: int64

In [ ]:
print( s.values )  # 값 확인
print( s.index )   # 인덱스 확인
print( s.dtype )   # 타입 확인

[ 4  7 -5  3]
Index(['d', 'b', 'a', 'c'], dtype='object')
int64

#### Pandas 연습 01
각 도시의 2015년 인구 데이터를 시리즈로 만드시오.
```
서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64
```

In [ ]:
s = pd.Series([9904312, 3448737, 2890451,2466052], 
              index=["서울", "부산", "인천", "대구"])
s

#### Series

In [ ]:
# Series 이름 지정
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [ ]:
# Series 연산
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [ ]:
# Series 인덱싱
s[1], s["부산"]

s[3], s["대구"]

s[[0,3,1]]
s[["서울", "대구","부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [ ]:
# Series 슬라이싱
s[1:3], s["부산":"대구"]

(도시
 부산    3448737
 인천    2890451
 Name: 인구, dtype: int64, 도시
 부산    3448737
 인천    2890451
 대구    2466052
 Name: 인구, dtype: int64)

In [ ]:
# Series Boolean 인덱싱
# 인구 250만 이상 도시
s >= 2500000, s[s >= 2500000]

(도시
 서울     True
 부산     True
 인천     True
 대구    False
 Name: 인구, dtype: bool, 도시
 서울    9904312
 부산    3448737
 인천    2890451
 Name: 인구, dtype: int64)

In [ ]:
# 인구 500만 이하 도시
s[s <= 5000000]

# 인구 250만 이상 500만 이하 도시
s[(s >= 2500000) & ( s <= 5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [ ]:
# 딕셔너리 객체로 Series 생성 (2010년 인구수)
data = {"서울": 9631482, "부산": 3393191, 
        "인천": 2632035, "대전": 1490158 }
s2 = pd.Series(data)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [ ]:
# 2015년도와 2010년도의 인구 증가를 계산
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [ ]:
ds.notnull(), ds[ds.notnull()]

(대구    False
 대전    False
 부산     True
 서울     True
 인천     True
 dtype: bool, 부산     55546.0
 서울    272830.0
 인천    258416.0
 dtype: float64)

In [ ]:
ds.isnull(), ds[ds.isnull()]

(대구     True
 대전     True
 부산    False
 서울    False
 인천    False
 dtype: bool, 대구   NaN
 대전   NaN
 dtype: float64)

In [ ]:
# 2015년도와 2010년도의 인구 증가율(%)를 계산
rs = (s - s2) / s2 * 100
rs[ rs.notnull() ]

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [ ]:
# Series 데이터 갱신, 추가, 삭제
rs["부산"] = 1.6
rs["대구"] = 1.41
del rs["서울"]
rs[rs.notnull()]

대구    1.410000
부산    1.600000
인천    9.818107
dtype: float64

### DataFrame

In [ ]:
# DataFrame 생성
data = {"2015": [9904312, 3448737, 2890451, 2466052],
        "2010": [9631482, 3393191, 2632035, 2431774] }
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [ ]:
# DataFrame 인덱스 수정
df.index = ["서울","부산","인천","대구"]
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [ ]:
# DataFrame 인덱스 지정하여 생성
data = [[9904312, 3448737, 2890451, 2466052],
        [9631482, 3393191, 2632035, 2431774]]
ind = ["2015", "2010"]
col = ["서울", "부산", "인천", "대구"]
df2 = pd.DataFrame(data, index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [ ]:
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

#### Pandas 연습 02
DataFrame을 이용하여 아래와 같은 결과를 구성하시오.

| |홍길동|	김사또|	임꺽정|
|---|---|---|---|
|키|	175.3|	180.2|	178.6|
|몸무게|	66.2|	78.9|	55.1|
|나이|	27.0|	49.0|	35.0|

In [ ]:
data = [[175.3, 180.2, 178.6],
        [66.2, 78.9, 55.1],
        [27.0, 49.0, 35.0]]
ind = ["키", "몸무게","나이"]
col = ["홍길동", "김사또", "임꺽정"]
df3 = pd.DataFrame(data, index = ind, columns = col)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0

#### DataFrame

In [ ]:
df.values    # 값 확인
df.index     # 인덱스 확인
df.columns   # 컬럼 확인

Index(['2015', '2010'], dtype='object')

In [ ]:
# DataFrame 열 인덱스

df["2015"]
df["2010"]
df[["2010", "2015"]]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [ ]:
df[["2015", "2010"]]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [ ]:
# "2005" 라는 컬럼명으로 2005년 인구수 대입
df["2005"] = [9762546, 3512547, 2517680, 2456016]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [ ]:
# DataFrame 행 인덱스

df[0:1]
df["서울":"인천"]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

In [ ]:
# DataFrame Boolean 인덱스
df["2010"] >= 2500000
df[df["2010"] >= 2500000]

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680

#### loc, iloc 인덱서

In [ ]:
# loc[] - 실제 인덱스를 사용하여 행을 가지고 올 때 사용
df.loc["서울":"부산" , "2015":"2010"]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [ ]:
# iloc[] - numpy의 array인덱싱 방식으로 행을 가지고 올 때 사용
df.iloc[3]

2015    2466052
2010    2431774
2005    2456016
Name: 대구, dtype: int64

#### csv 파일-1

population_number.csv

In [ ]:
p_number = pd.read_csv(drive_path + "population_number.csv", encoding="euc-kr")
p_number

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [ ]:
p_number = pd.read_csv(drive_path + "population_number.csv", index_col="도시", encoding="euc-kr")
p_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [ ]:
# 데이터 개수
p_number.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [ ]:
# value_counts 함수
# - 값이 숫자, 문자열, 카테고리 값인 경우에 각각의 값이 나온 횟수를 셀 수 있다.
import numpy as np

s2 = pd.Series(np.random.randint(6, size=100))
s2.tail(10)
s2.value_counts()

0    22
5    21
1    18
4    16
2    12
3    11
dtype: int64

In [ ]:
p_number["2015"].value_counts()

2466052    1
2890451    1
3448737    1
9904312    1
Name: 2015, dtype: int64

In [ ]:
p_number["2010"].value_counts()

9631482.0    1
2431774.0    1
2632035.0    1
Name: 2010, dtype: int64

In [ ]:
# 정렬
# sort_index 함수 : 인덱스 값을 기준으로 정렬한다.
# sort_values 함수 : 데이터 값을 기준으로 정렬한다.
p_number["2010"].sort_values

<bound method Series.sort_values of 도시
서울    9631482.0
부산          NaN
인천    2632035.0
대구    2431774.0
Name: 2010, dtype: float64>

In [ ]:
p_number["2010"].sort_values(ascending=True)

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [ ]:
# DataFrame을 2010년 인구수 기준으로 정렬
p_number.sort_values(by="2010")

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [ ]:
# DataFrame을 지역, 2010년 인구수 기준으로 정렬
p_number.sort_values(by=["지역", "2010"])

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

#### csv 파일-2

score.csv

In [ ]:
score = pd.read_csv(drive_path + "score.csv", index_col="과목", encoding="euc-kr")
score

    1반  2반  3반  4반
과목
수학  45  44  73  39
영어  76  92  45  69
국어  47  92  45  69
사회  92  81  85  40
과학  11  79  47  26

In [ ]:
# 학급별 총계
score.sum()

1반    271
2반    388
3반    295
4반    243
dtype: int64

In [ ]:
# 학급별 순위
score.sum().sort_values(ascending=False)

2반    388
3반    295
1반    271
4반    243
dtype: int64

In [ ]:
# 과목별 총계
score.sum(axis=1)

과목
수학    201
영어    282
국어    253
사회    298
과학    163
dtype: int64

In [ ]:
# 과목별 합계를 DataFrame에 추가
score["합계"] = score.sum(axis=1)
score

In [ ]:
# max(), min()
score.max()

1반     92.0
2반     92.0
3반     85.0
4반     69.0
합계    298.0
평균     74.5
dtype: float64

In [ ]:
score.max(axis=1)

과목
수학     201.0
영어     282.0
국어     253.0
사회     298.0
과학     163.0
반평균    239.4
dtype: float64

In [ ]:
score.min()

1반     11.00
2반     44.00
3반     45.00
4반     26.00
합계    163.00
평균     40.75
dtype: float64

In [ ]:
score.min(axis=1)

과목
수학     39.0
영어     45.0
국어     45.0
사회     40.0
과학     11.0
반평균    48.6
dtype: float64

#### Pandas 연습 03-1

과목별 평균을 계산하여 column 추가하기
```

        1반  2반	3반	4반	합계	평균
과목						
수학	45	44	73	39	201	50.25
영어	76	92	45	69	282	70.50
국어	47	92	45	69	253	63.25
사회	92	81	85	40	298	74.50
과학	11	79	47	26	163	40.75
```

In [ ]:
score["평균"] = score.loc[:, :"4반"].mean(axis=1)
score

    1반  2반  3반  4반   합계     평균
과목
수학  45  44  73  39  201  50.25
영어  76  92  45  69  282  70.50
국어  47  92  45  69  253  63.25
사회  92  81  85  40  298  74.50
과학  11  79  47  26  163  40.75

#### Pandas 연습 03-2

반평균을 계산 하여 row 추가 하기
```
	      1반	2반	 3반 	4반 	합계	평균
과목						
수학	45.0	44.0	73.0	39.0	201.0	50.25
영어	76.0	92.0	45.0	69.0	282.0	70.50
국어	47.0	92.0	45.0	69.0	253.0	63.25
사회	92.0	81.0	85.0	40.0	298.0	74.50
과학	11.0	79.0	47.0	26.0	163.0	40.75
반평균  54.2	77.6	59.0	48.6	239.4	59.85
```

In [ ]:
score.loc["반평균"] = score.mean(axis=0)
score

       1반    2반    3반    4반     합계     평균
과목
수학   45.0  44.0  73.0  39.0  201.0  50.25
영어   76.0  92.0  45.0  69.0  282.0  70.50
국어   47.0  92.0  45.0  69.0  253.0  63.25
사회   92.0  81.0  85.0  40.0  298.0  74.50
과학   11.0  79.0  47.0  26.0  163.0  40.75
반평균  54.2  77.6  59.0  48.6  239.4  59.85

#### Pandas 연습 03-3

반 평균, 합계, 평균을 제외한 데이터 중 과목별 가장 큰 값, 작은 값을 구하시오.

In [ ]:
max_arr = score.loc[:"과학",:"4반"].max(axis=1)
max_arr

과목
수학    73.0
영어    92.0
국어    92.0
사회    92.0
과학    79.0
dtype: float64

In [ ]:
min_arr = score.loc[:"과학",:"4반"].min(axis=1)
min_arr

과목
수학    39.0
영어    45.0
국어    45.0
사회    40.0
과학    11.0
dtype: float64

#### Pandas 연습 03-4

과목별 가장 큰 값과 작은 값의 차를 구하시오.

In [ ]:
max_arr - min_arr

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

#### apply 변환

행이나 열 단위로 더 복잡한 처리를 하고 싶을 때 사용
```
DataFrame.apply( func, axis = 0)
```

In [ ]:
# 과목별 가장 큰 값과 작은 값의 차
def max_min(x):
  return x.max() - x.min()

score.loc[:"과학", :"4반"].apply(max_min, axis=1)

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [ ]:
score.loc[:"과학", :"4반"].apply(lambda x:x.max()-x.min() , axis=1)

과목
수학    34.0
영어    47.0
국어    47.0
사회    52.0
과학    68.0
dtype: float64

In [ ]:
data_dic = {"A":[1,3,3,4,4], "B":[1,2,2,3,3], "C":[1,2,4,4,5]}
df3 = pd.DataFrame(data_dic)
df3

   A  B  C
0  1  1  1
1  3  2  2
2  3  2  4
3  4  3  4
4  4  3  5

In [ ]:
# apply를 사용하여 각 열에 대해 어떤 값이 얼마나 사용되었는지 알고 싶다면
# value_counts 함수 사용 가능
df4 = df3.apply(pd.value_counts)
df4

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [ ]:
# fillna 함수
# 결측치(NaN)를 원하는 값으로 바꿀 수 있다.
df4.fillna(value=0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

#### 카테고리

In [8]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 100]
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut( ages, bins, labels=labels)
cats

[NaN, 미성년자, 미성년자, 청년, 청년, ..., 노년, 청년, 장년, 중년, NaN]
Length: 12
Categories (5, object): [미성년자 < 청년 < 중년 < 장년 < 노년]

In [ ]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [ ]:
cats.categories

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [ ]:
# DataFrame 으로
age_arr = pd.DataFrame(ages, columns=["ages"])
age_arr

    ages
0      0
1      2
2     10
3     21
4     23
5     37
6     31
7     61
8     20
9     41
10    32
11   100

In [ ]:
# 카테고리 추가
age_arr["age_cat"] = pd.cut(ages, bins, labels=labels)
age_arr

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      장년
6     31      중년
7     61      노년
8     20      청년
9     41      장년
10    32      중년
11   100     NaN

In [ ]:
# 카테고리별 나이 개수
age_arr['age_cat'].value_counts()

청년      3
장년      2
중년      2
미성년자    2
노년      1
Name: age_cat, dtype: int64

#### Pandas 연습 04-1

1. 타이타닉호 승객 데이터(train.csv)를 데이터프레임으로 읽어 온다.

2. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [4]:
train = pd.read_csv(drive_path + "train.csv", index_col="PassengerId")
train.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

#### Pandas 연습 04-2

1. 타이타닉호 승객 중 성별(Sex) 인원수, 나이별(Age) 인원수, 선실별(Pclass) 인원수, 사망/생존(Survived) 인원수를 구하라.

In [ ]:
train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [ ]:
train['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [ ]:
train['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [ ]:
train['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

#### Pandas 연습 04-3

1. 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고 각 그룹에 대해  ‘미성년자‘, ‘청년‘, ‘중년‘, ‘장년‘, ‘노년’ 승객의 비율을 구하라.

(단, 그룹별 비율의 전체 합은 1이 되어야 한다.)
```
bins = [0, 15, 25, 35, 60, 99]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
```

In [5]:
# 생존자 그룹
servived_1 = train[ train['Survived'] == 1 ]
servived_1

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C
...               ...     ...  ...   ...      ...
876                 1       3  ...   NaN        C
880                 1       1  ...   C50        C
881                 1       2  ...   NaN        S
888                 1       1  ...   B42        S
890                 1       1  ...  C148        C

[342 rows x 11 columns]

In [9]:
# 생존자 그룹 카테고리화
servived_1_cuts = pd.cut(servived_1['Age'], bins, labels=labels)
servived_1_cuts.value_counts()

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: Age, dtype: int64

In [10]:
# 비율
total = servived_1_cuts.count()
servived_1_cuts.value_counts() / total

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: Age, dtype: float64

In [11]:
# 사망자 그룹
servived_0 = train[ train['Survived'] == 0 ]
servived_0

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
889                 0       3  ...   NaN        S
891                 0       3  ...   NaN        Q

[549 rows x 11 columns]

In [12]:
# 사망자 그룹 카테고리화
servived_0_cuts = pd.cut(servived_0['Age'], bins, labels=labels)
servived_0_cuts.value_counts()

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: Age, dtype: int64

In [13]:
# 비율
total = servived_0_cuts.count()
servived_0_cuts.value_counts() / total

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: Age, dtype: float64

#### groupby

In [14]:
df5 = pd.DataFrame({
    'key1':['A','A', 'B', 'B', 'A'],
    'key2':['one','two','one','two','one'],
    'data1': [1, 2, 3, 4, 5],
    'data2': [10, 20, 30, 40, 50]
})
df5

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [15]:
df5[['key1','data2']]

  key1  data2
0    A     10
1    A     20
2    B     30
3    B     40
4    A     50

In [16]:
g = df5[['key1','data2']].groupby('key1')
for x, y in g:
    print(x)
    print(y)

A
  key1  data2
0    A     10
1    A     20
4    A     50
B
  key1  data2
2    B     30
3    B     40

In [17]:
g.sum()

      data2
key1
A        80
B        70

#### Pandas 연습 04-4

1. 선실(Pclass), 성별(Sex)로 생존자 수를 구하라.

In [18]:
train[['Pclass','Sex','Survived']].groupby(['Pclass','Sex']).sum()

               Survived
Pclass Sex
1      female        91
       male          45
2      female        70
       male          17
3      female        72
       male          47